{
    "?": "Please report all issues to: https://github.com/Ghostom998/pics2word/issues\nRaise a new issue then:\n- Please describe the issue as accurately as possible with the ouput from the log file and any error message given in the terminal window.\n- Please describe exactly what you did to trigger the event including the commands that were passed\n- Note the operating system, version of python used and pics2word version\n- Include any further relavent information you deem useful.",
    "f": "Name: Format command\nFunction: Allows the user to define the format that the pictures are presented.\n\t  Normal simply copies the picture into the table with the title on the next line\n\t  Table will copy the pictures into a table with the title in the cell beneath.\nOptions: \"normal\" and \"table\" are valid options.\nDefault: \"normal\"",
    "help": "Usage: pics2word [-command] [value]\nOptions:\n\t-h\t- Pass \"help\" to print this help message to the terminal.\n\t\t  Pass the name of a command below without the '-' for more informatio about that command.\n\t\t  Pass \"?\" if you cant find what you are looking for or having issues.\n\t-P\t- Pass an alternative path to be used. i.e. \"C:\\\\Pictures\\\". Defaults to current directory.\n\t-f\t- format pictures. pass either \"normal\" or \"table\". Defaults to normal. \n\t-T\t- Override the default title. Defaults to PhotoDoc_<current date> (See Td, below).\n\t-Td\t- Choose to append the title with the current date. Options: \"y\" or \"n\". Defaults to \"y\".\n\t-pw\t- Set the width of imported pictures in inches. Defaults to 4 inches\n\t-ph\t- Set the height of imported pictures in inches. Defaults to 4 inches\n\t-tw\t- Set the number of columns used in table format. Note: table format must be enabled! Defaults to 2.\n\t-m\t- Module. Allows the creation of templates. \n\nCommands may be passed as command-value pairs in any order.\nAll commands are optional and the defaults will be used if no commands are given.\n\nExample: pics2word -P \"C:\\\\Pictures\\\" -T Report -Td n -f table\n",
    "m": "Name:\t  Module command\nFunction: This command allows the user to define and use templates Pass -m \"report\" to load the arguments saved in that module. \n\t  If the module name does not exist then one will be created under the passed name using the passed arguments as saved values.\n\t  Note that when loading the template, arguments passed with a loaded module will overwrite the template values but do not \n\t  save permanently.\nOptions:  A valid name for a module must be used. If you are looking to load a module, make sure it exists in the current directory.\nDefault:  If no modifications to the commands are given, then the default values set by the program will be used.",
    "p": "Name: Path command\nFunction: This allows the user to use pictures from an alternative directory.\nOptions: Any valid path. i.e. \"C:\\\\user\\Joe Bloggs\\pictures\"\nDefault: In the absense of any path being passed, the program will \n\t  use the current directory of the terminal running it.",
    "ph": "Name: Picture Height \nFunction: Allows the user to define the height of the picture in inches.\n\t  Important: Aspect ratio is preserved. This option restricts the height of portrait pictures only.\n\t  for further control it is recommended that the an option for 'pw' also be passed. \nOptions: Any positive number. Recommended values of 5 for normal usage, 2.5 for table usage (2 columns)\nDefault: 4 inches",
    "pw": "Name: Picture Width\nFunction: Allows the user to define the width of the picture in inches.\n\t  Important: Aspect ratio is preserved. This option restricts the width of landscape pictures only.\n\t  for further control it is recommended that the an option for 'ph' also be passed. \nOptions: Any positive number. Recommended values of 5 for normal usage, 3 for table usage (2 columns)\nDefault: 4 inches",
    "t": "Name: Title command\nFunction: Allows the user to specify a title for the saved word document.\n\t  Note: If this command is used then a value for 'Td' MUST be given. \nOptions: If giving a name with spaces then you will need to pass the name in quotes, thus: \"my report\"\nDefault: \"PhotoDoc_<date>\" where <date> is the current date.",
    "td": "Name: Title Date command\nFunction: Gives the user the option to append the current date at the end of the title of the word document.\n\t  Note: If a custom title is used then a value for 'Td' MUST be given.\n\t  Example date format is produced thus: \"09Mar2018\"  For 9th March 2018\nOptions: 'y' or 'n' for yes or no.\nDefault: 'y' as part of the default title. Otherwise the user will have to give an option.",
    "tw": "Name: Table Width\nFunction: Define the number of columns in the table.\n\t  Important: The \"table\" format MUST be specified for this command to take effect.\nOptions: Any positive integer. Recommended values between 1 & 3 for portrait A4.\nDefault: 2 columns"
}